[
  {
    "author": "Katherine G",
    "text": "Sheffield Collision’s has helped me numerous times with my 4 Runner! The staff was incredibly professional, keeping me updated throughout the entire process! With reasonable quoting and excellent service, I’ll definitely be using them again if ever needed. Thank you to Ally, Jordan, Mr. Sheffield, and the entire team!",
    "rating": 5
  },
  {
    "author": "Amy N",
    "text": "Great experience with Sheffield Collision, our car looks as good as it did when we drove it off the lot a few months ago. Thurston and his staff handled everything with the insurance companies, kept us updated on progress, even got us back and forth from the rental car agency. Hopefully won't need his services in the near future, but if we do, will definitely use Sheffield Collision again.",
    "rating": 5
  },
  {
    "author": "Veronica W",
    "text": "I hit something in the road heading north on I-75 in July 2020. I finally got the damage fixed this year at Sheffields Collision Center. Everyone I interacted with were polite, professional, and willing to go the extra mile in the pursuit of customer service excellence!.",
    "rating": 5
  },
  {
    "author": "Jeff J",
    "text": "Outstanding company. They did an amazing job with body work on my vehicle. I was really impressed. And, Allie and Mr Sheffield were very polite and customer-focused whenever I spoke with them by phone or by email. They took great care of me. My vehicle had a flat tire; they graciously repaired it at no additional costs.",
    "rating": 5
  },
  {
    "author": "David M",
    "text": "Great work Thurston. All timetables meet. Explained in a clear, precise way what was to be done to my CRV. Price was hard to beat. Exceeded my expectations. Customer Service is second to none. Would definitely return if other issues come up. Thanks again Thurston",
    "rating": 5
  },
  {
    "author": "Raven V",
    "text": "They handled my repairs and if I could give 6 stars, I would! Absolutely amazing customer service and repair work. They made my car look brand new off the lot inside and out. Allie answered every question I had with ultimate patience.",
    "rating": 5
  },
  {
    "author": "Amethyst F",
    "text": "Sheffield's has always done excellent work on our cars. Having a car in a collision shop is a stressful time and it's so much better when you are treated well and kept updated throughout the process. Thank you for taking care of us and our friends and family as well. We wouldn't waste our time anywhere else !! … More",
    "rating": 5
  },
  {
    "author": "Billy W",
    "text": "Good people to deal with! I furnished a replacement side skirt to be painted and installed on my Trans Am and wanted the other side repaired and painted. They told me it was not reparable and managed to find a perfect replacement for it.",
    "rating": 5
  },
  {
    "author": "Glenn A",
    "text": "I was tired of getting the run around with all these big chain box stores in Columbus. I decided to take my vehicle to Sheffield Collision Center. I described the noises I have been noticing with the car. Thurston and his team were very … More",
    "rating": 5
  },
  {
    "author": "Bonnie S",
    "text": "When you need car help, you can feel pretty helpless. The folks at Sheffields seem to understand that and do everything they can to make a tough situation a pleasant experience. The integrity and honesty are evident, and the service makes … More",
    "rating": 5
  },
  {
    "author": "Philiceana W",
    "text": "I visited Sheffield back in September of this year so this is a late review, however I waited this long to see if I would really be satisfied with the overall results of the work done to my car & I must say that this is by far the best … More",
    "rating": 5
  },
  {
    "author": "Lauren",
    "text": "Sheffield’s Collision Center was very professional and awesome to work with. They were able to get me in and out the same day my A/C went out. It was fixed right away and I’ve had no issues since. They kept me updated on the progress and … More",
    "rating": 5
  },
  {
    "author": "Wendy T",
    "text": "I took my vehicle to Sheffield Collision for repair after an accident, upon recommendation of a family member. Hands down, this was the most professional collision center I have used, and I have used a few over the last decade!",
    "rating": 5
  },
  {
    "author": "Anne Y",
    "text": "I took me vehicle here after an accident for an estimate. They completed an estimate while I waited and I brought it in the following day for repair. The repair actually cost a little less than the estimate and the owner gave me the … More",
    "rating": 5
  },
  {
    "author": "Daune J",
    "text": "I used Sheffields Collision today after a deer hit my car. The service experience was awesome. Their waiting area is so nice. I was able to work with my laptop while sitting and waiting for them to complete my car. Everyone was so nice … More",
    "rating": 5
  },
  {
    "author": "Alex S",
    "text": "BEST BODY SHOP! Other places were making my life so difficult when trying to get my car fixed but Sheffield's had incredible customer service, they got my car in and out super fast! They also did an amazing job on the repairs.",
    "rating": 5
  },
  {
    "author": "Bob M",
    "text": "Thurston, Ally and the rest of his team did a great job on my Mustang to find and fix a stubborn water leak on the passenger side. Superior customer service and support throughout.",
    "rating": 5
  },
  {
    "author": "Brian W",
    "text": "Awesome service, took care of everything and the price was the best in town. Very easy process and man the service was top notch. Truck looks bran new again. We thank you at P.V.F.",
    "rating": 5
  },
  {
    "author": "Jim O",
    "text": "I needed a new passenger side mirror and rear dooMorer handle on my pickup truck.Sheffield's collision center ordered them for me. My air conditioning was blowing out hot air. ",
    "rating": 5
  },
  {
    "author": "D Lewis",
    "text": "If I could do 10 stars I would. The owner is a really great and humble man. Although my car did not need major work. It was a simple fix and he did it in a matter of minutes.",
    "rating": 5
  }
]